Revit 2026 API

# SteelElementPropertiesGetSteelElementProperties Method

---

Get SteelElementProperties for the input element if they exist.

**Namespace:** Autodesk.Revit.DB.Steel**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static SteelElementProperties GetSteelElementProperties(
	Element pElement
)
```
```vb
Public Shared Function GetSteelElementProperties (
	pElement As Element
) As SteelElementProperties
```
```cpp
public:
static SteelElementProperties^ GetSteelElementProperties(
	Element^ pElement
)
```
```fsharp
static member GetSteelElementProperties :
        pElement : Element -> SteelElementProperties
```

#### Parameters

pElement Element
     The element from which we try to obtain SteelElementProperties.

#### Return Value

SteelElementProperties

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the input element doesn't have steel informations than it retuns .

#### Reference

SteelElementProperties Class

Autodesk.Revit.DB.Steel Namespace